# DimValueLength Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..DimValueLength Property
ParameterTypeId Class See Also
---
"Value"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId DimValueLength { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property DimValueLength As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ DimValueLength {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace